app/controllers/login_controller.rb

SELECT "users".* FROM "users" WHERE "users"."name" = $1 LIMIT $2  [["name", "sushmitha"], ["LIMIT", 1]]
---
  def sign_in
    @user = User.find_by(name: params[:user][:name])