app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    if @product.save
---
INSERT INTO "products" ("product_id", "product_name", "desc", "sku", "category_id", "inventory_id", "price", "discount_id", "created_at", "updated_at") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10) RETURNING "id"

  def update
    @product = Product.find_by(id: params[:id])

    if @product.update(product_params)
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
UPDATE "products" SET "desc" = $1, "updated_at" = $2 WHERE "products"."id" = $3  [["desc", "mouse discription as follows"], ["updated_at", "2024-04-05 09:38:28.491174"], ["id", 2]]

  def edit
    @product = Product.find_by(id: params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]